class KeyboardLayout():
    def __init__(self):
        self.char_map = [
            #non shift layout
            [
                ['ๅ','/','-','ภ','ถ','ุ','ึ','ค','ต','จ','ข','ช'],
                ['ๆ','ไ','ำ','พ','ะ','ั','ี','ร','น','ย','บ','ล'],
                ['ฟ','ห','ก','ด','เ','้','่','า','ส','ว','ง','ฃ'],
                ['','ผ','ป','แ','อ','ิ','ื','ท','ม','ใ','ฝ','']
            ],
            #shift layout
            [
                ['+','๑','๒','๓','๔','ู','฿','๕','๖','๗','๘','๙'],
                ['๐','"','ฎ','ฑ','ธ','ํ','๊','ณ','ฯ','ญ','ฐ',','],
                ['ฤ','ฆ','ฏ','โ','ฌ','็','๋','ษ','ศ','ซ','.','ฅ'],
                ['','(',')','ฉ','ฺ','์','?','ฒ','ฬ','ฦ','']
            ]
        ]
    def position(character):
        pass

